api/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
    def index
        admins = Admin.all

SELECT "admins".* FROM "admins" WHERE "admins"."employee_id" = ? LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]
---
    def get_details
      begin
        admin = Admin.find_by(employee_id: params[:employee_id]) # Adjust the finding logic as needed

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "admins" SET "updated_at" = ?, "password_digest" = ? WHERE "admins"."id" = ?  [["updated_at", "2023-11-28 13:54:54.458237"], ["password_digest", "[FILTERED]"], ["id", 1]]
---
    def update
      begin
        admin = Admin.find(params[:id]) # Find the admin by ID
        if admin
          if admin.update(admin_params)

SELECT COUNT(*) FROM "admins"
---
    def count
      begin
        count = Admin.count # Count the number of student records