api/app/controllers/branches_controller.rb

    def index
        begin
        branches = Branch.all
---
SELECT "branches".* FROM "branches"

    def create
        begin
          name = params[:name]
          branch = Branch.find_by(name: name) # Find the branch by name

          if branch
            render json: { success: false, message: "Already Exists!" }, status: :bad_request
          else
            Branch.create(branch_params)
---
SELECT "branches".* FROM "branches" WHERE "branches"."name" = ? LIMIT ?  [["name", "Computer Science"], ["LIMIT", 1]]
INSERT INTO "branches" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Computer Science"], ["created_at", "2023-11-28 12:55:19.485645"], ["updated_at", "2023-11-28 12:55:19.485645"]]

    def destroy
        branch = Branch.find(params[:id]) # Find the Branch by ID
        branch.destroy
---
SELECT "branches".* FROM "branches" WHERE "branches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "branches" WHERE "branches"."id" = ?  [["id", 1]]

    def count
      begin
        count = Branch.count # Count the number of branch/ course records
---
SELECT COUNT(*) FROM "branches"