api/app/controllers/faculties_controller.rb

          def index
              faculties = Faculty.all
---
SELECT "faculties".* FROM "faculties"

          def get_faculty
            begin
              faculty = Faculty.find_by(employee_id: params[:employee_id]) # Adjust the finding logic as needed
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."employee_id" = ? LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]

           def register
            faculty = Faculty.new(faculty_params)
            if faculty.valid?
              session[:loginid] = faculty.id
              session_token = SecureRandom.hex(32)
              faculty.save(session_token: session_token)
---
INSERT INTO "faculties" ("firstName", "middleName", "lastName", "email", "phoneNumber", "gender", "profile", "department", "experience", "post", "created_at", "updated_at", "employee_id", "loginid", "password_digest", "session_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

          def create
            begin
              faculty = Faculty.find_by(employee_id: params[:employee_id]) # Adjust the finding logic as needed
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."employee_id" = ? LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]

          def update
            begin
              faculty = Faculty.find(params[:id]) # Find the admin by ID
              if faculty
                if faculty.update(faculty_params)
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "faculties" SET "middleName" = ?, "updated_at" = ? WHERE "faculties"."id" = ?  [["middleName", "Limo"], ["updated_at", "2023-11-28 13:57:46.880877"], ["id", 1]]

          def count
            begin
              count = Faculty.count # Count the number of faculty records
---
SELECT COUNT(*) FROM "faculties"