api/app/controllers/marks_controller.rb

SELECT "students".* FROM "students" WHERE "students"."enrollment_no" = ? LIMIT ?  [["enrollment_no", 1], ["LIMIT", 1]]
SELECT "marks".* FROM "marks" WHERE "marks"."enrollment_no" = ?  [["enrollment_no", 1]]
SELECT 1 AS one FROM "marks" WHERE "marks"."enrollment_no" = ? LIMIT ?  [["enrollment_no", 1], ["LIMIT", 1]]
---
    def get_student_marks
      begin
        student = Student.find_by(enrollment_no: params[:enrollment_no])
        if student
          marks = Mark.where(enrollment_no: student.enrollment_no)
          if marks.any?

INSERT INTO "marks" ("enrollment_no", "created_at", "updated_at", "examType", "score", "subject") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      mark = Mark.new(mark_params)
      if mark.save