api/app/controllers/notices_controller.rb

    def index
      notices = Notice.all
---
SELECT "notices".* FROM "notices"

    def create
      notice = Notice.new(notice_params)
      if notice.save
---
INSERT INTO "notices" ("title", "description", "intended_for", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def destroy
        notice = Notice.find(params[:id])
      if notice.destroy
---
SELECT "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notices" WHERE "notices"."id" = ?  [["id", 1]]