api/app/controllers/sessions_controller.rb

  def create
    admin = Admin.find_by(loginid: params[:loginid])
    if admin&.authenticate(params[:password])
      session_token = generate_session_token(admin) # Generate session token
      session[:loginid] = admin.id
      admin.update(session_token: session_token) # Save session token for the admin in your database or other secure storage
---
SELECT "admins".* FROM "admins" WHERE "admins"."loginid" = ? LIMIT ?  [["loginid", 1], ["LIMIT", 1]]
UPDATE "admins" SET "updated_at" = ?, "session_token" = ? WHERE "admins"."id" = ?  [["updated_at", "2023-11-28 12:54:57.799007"], ["session_token", "[FILTERED]"], ["id", 1]]

  def create_faculties
    faculty = Faculty.find_by(loginid: params[:loginid])
    if faculty&.authenticate(params[:password])
      session_token = generate_session_token_faculty(faculty) # Generate session token
      session[:loginid] = faculty.id
      faculty.update(session_token: session_token) # Save session token for the faculty in your database or other secure storage
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."loginid" = ? LIMIT ?  [["loginid", 1], ["LIMIT", 1]]
UPDATE "faculties" SET "updated_at" = ?, "password_digest" = ? WHERE "faculties"."id" = ?  [["updated_at", "2023-11-28 14:03:55.176530"], ["password_digest", "[FILTERED]"], ["id", 1]]

   def create_students
    student = Student.find_by(loginid: params[:loginid])
    if student&.authenticate(params[:password])
      session_token = generate_session_token_student(student) # Generate session token
      session[:loginid] = student.id
      student.update(session_token: session_token) # Save session token for the student in your database or other secure storage
---
SELECT "students".* FROM "students" WHERE "students"."loginid" = ? LIMIT ?  [["loginid", 1], ["LIMIT", 1]]
UPDATE "students" SET "updated_at" = ?, "session_token" = ? WHERE "students"."id" = ?  [["updated_at", "2023-11-28 14:21:29.258858"], ["session_token", "[FILTERED]"], ["id", 1]]