api/app/controllers/students_controller.rb

          def index
              students = Student.all
---
SELECT "students".* FROM "students"

          def get_student
            begin
              student = Student.find_by(enrollment_no: params[:enrollment_no]) # Adjust the finding logic as needed
---
SELECT "students".* FROM "students" WHERE "students"."enrollment_no" = ? LIMIT ?  [["enrollment_no", 1], ["LIMIT", 1]]

          def register
            student = Student.new(student_params)
            if student.valid?
              session[:loginid] = student.id
              session_token = SecureRandom.hex(32)
              student.save(session_token: session_token)
---
INSERT INTO "students" ("firstName", "middleName", "lastName", "email", "phoneNumber", "profile", "enrollment_no", "branch", "semester", "gender", "created_at", "updated_at", "loginid", "password_digest", "session_token", "education_level") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

          def create
            begin
              student = Student.find_by(enrollment_no: params[:enrollment_no]) # Adjust the finding logic as needed
---
SELECT "students".* FROM "students" WHERE "students"."enrollment_no" = ? LIMIT ?  [["enrollment_no", 1], ["LIMIT", 1]]

          def update
            begin
              student = Student.find(params[:id]) # Find the student by ID
              if student
                if student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "updated_at" = ?, "password_digest" = ? WHERE "students"."id" = ?  [["updated_at", "2023-11-28 18:43:56.138549"], ["password_digest", "[FILTERED]"], ["id", 1]]

          def count
            begin
              count = Student.count # Count the number of student records
---
SELECT COUNT(*) FROM "students"