api/app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def index
    subjects = Subject.all

INSERT INTO "subjects" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Introduction to C Programming"], ["code", 101], ["created_at", "2023-11-28 14:01:23.022592"], ["updated_at", "2023-11-28 14:01:23.022592"]]
---
  def create
    subject = Subject.new(subject_params)

    if subject.save