api/app/controllers/timetables_controller.rb

SELECT "timetables".* FROM "timetables"
---
    def index
      timetables = Timetable.all

INSERT INTO "timetables" ("link", "branch", "semester", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
      timetable = Timetable.new(timetable_params)

      if timetable.save